app/controllers/api/voters_controller.rb

SELECT "voters".* FROM "voters" WHERE "voters"."booth_name" = $1 ORDER BY "voters"."id" ASC LIMIT $2 OFFSET $3  [["booth_name", "m"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "voters" WHERE "voters"."booth_name" = $1  [["booth_name", "m"]]
---
  def index
    voters= Voter.all


    if params[:constituency].present?
      voters = voters.where(constituency: params[:constituency])
     end

      if params[:booth_name].present?
    voters = voters.where(booth_name: params[:booth_name])
  end

    voters = voters.order(id: :asc).paginate(page: params[:page], per_page:5)
    total_count = voters.count,
    per_page = 5,
    ratio = (voters.count.to_f/per_page).ceil

SELECT DISTINCT "voters"."booth_name" FROM "voters" WHERE (Lower(booth_name) LIKE '%m%')
---
  def search_by_booth_name

    booth_name = params[:booth_name].downcase
   boothNames =Voter.where("Lower(booth_name) LIKE ?","%#{booth_name}%").distinct.pluck(:booth_name)

SELECT "voters".* FROM "voters" WHERE "voters"."id" = $1 LIMIT $2  [["id", 9389], ["LIMIT", 1]]
UPDATE "voters" SET "casted" = $1, "figured_by" = $2, "updated_at" = $3, "party" = $4 WHERE "voters"."id" = $5  [["casted", true], ["figured_by", "test"], ["updated_at", "2024-07-12 13:31:51.592948"], ["party", "YSRCP"], ["id", 9389]]
---
  def update
    voter = Voter.find(params[:id])
    if voter.update(voter_params)

SELECT "voters".* FROM "voters" WHERE "voters"."booth_name" = $1 AND "voters"."casted" = $2 ORDER BY "voters"."id" ASC LIMIT $3 OFFSET $4  [["booth_name", "S.B.T.S Mpl. .P. Sch Ool,Mandapeta"], ["casted", false], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "voters" WHERE "voters"."booth_name" = $1 AND "voters"."casted" = $2  [["booth_name", "S.B.T.S Mpl. .P. Sch Ool,Mandapeta"], ["casted", false]]
---
  def filter_casted_status
  casted_param = params[:casted]
  if casted_param.nil?
    render json: { error: "Please provide a 'casted' parameter with a value of true or false." }, status: :bad_request
    return
  end

  casted_value = ActiveModel::Type::Boolean.new.cast(casted_param)

  voters = Voter.all

  if params[:constituency].present?
    voters = voters.where(constituency: params[:constituency])
  end

  if params[:booth_name].present?
    voters = voters.where(booth_name: params[:booth_name])
  end

  voters = voters.where(casted: casted_value).order(id: :asc).paginate(page: params[:page], per_page: 3)